Revit 2027 API
ParameterTypeId.ViewSolarstudyStillPresetIndex Property
 "Still presets combo"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyStillPresetIndex { get; }
Public Shared ReadOnly Property ViewSolarstudyStillPresetIndex As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyStillPresetIndex {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyStillPresetIndex : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace